import os,time
os.system("clear") # เคลียร์ terminal

def home(): # สร้างฟังก์ชั่น
	try: # ตรวจสอบข้อมูล
		number = int(input("คุณต้องการไปชั้นไหน : ")) # สร้าง Input [number]
		print("กรุณารอสักครู่ขณะนี้ลิฟต์กำลังทำงาน...") # แสดงข้อความ
		time.sleep(2) # 2 วินาทีแล้วแสดงข้อความด้านล่าง
		print(f"ขณะนี้คุณอยู่ชั้นที่ {number}") # แสดงข้อมูล Input
	except: # หากเกิดข้อผิดพลาด
		print("เกิดข้อผิดพลาด !") # แสดงข้อความตอบกลับเมื่อเกิดข้อผิดพลาด
		
# เรียกใช้งานฟังก์ชั้น home โดยการพิมพ์คำว่า home() ตัวอย่างด้านล่าง
home()
# หากไม่เรียกใช้งานฟังก์ชั่น ก็จะไม่แสดงข้อมูลอะไรเลย
